/*-------------------------------------------------*/
/*            超子说物联网STM32系列开发板          */
/*-------------------------------------------------*/
/*                                                 */
/*          使用SysTick实现延时功能的头文件        */
/*                                                 */
/*-------------------------------------------------*/

#ifndef __DELAY_H
#define __DELAY_H 

#define US_UNIT   9            //延时1us 需要SysTick计几个数
#define MS_UNIT   1000         //延时ms时 单次最大1000ms

void Delay_CLock_Init(void);   //函数声明，初始化延迟计数器 配置时钟函数
void Delay_Us(uint16_t);       //函数声明，延时毫秒函数
void Delay_Ms(uint16_t);       //函数声明，延时微秒函数

#endif





























